Revit 2026 API

# FabricSheetFailures Properties

---

The BuiltInFailuresFabricSheetFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BentFabricSheetTooLongBendingProfile | The bent edge is shorter than the bend profile for this fabric sheet type. |
|  | FabricSheetOutSideOfHostError | Fabric Sheet is placed completely outside of its host. |
|  | FabricSheetOutSideOfHostWarning | Fabric Sheet is placed completely outside of its host. |

#### Reference

BuiltInFailuresFabricSheetFailures Class

Autodesk.Revit.DB Namespace